additiveTestCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    floor      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ceiling     
    {
       type             marangoni;
       marangonicoeff   0.1; //(dsigma/dt)*1/mu
        //value           uniform (0 0 0);
    }

    fixedWalls     
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* //
