additiveTestCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho [1 -3 0 0 0 0 0] 4000;
muE1             muE1 [1 -1 -2 0 0 0 0] 1;
lambdaE1         lambdaE1 [1 -1 -2 0 0 0 0] 1;
constant        constant [1 -1 -2 0 0 0 0] 1;
threeKalpha     threeKalpha [0 0 0 -1 0 0 0] (1 0 0 1 0 1);
ky         	ky [1 -1 -2 0 0 0 0] 1;
ky3         	ky3 [1 -1 -2 0 0 0 0] 10e6;
Tref            Tref [0 0 0 1 0 0 0] 300;

//liquid phase
cpL             cpL [0 2 -2 -1 0 0 0] 800;
lambdaL         lambdaL [1 1 -3 -1 0 0 0] 1;
nuL             nuL [0 2 -1 0 0 0 0] 1e-06; //kinematic viscosity

//solid phase
cpS             cpS [0 2 -2 -1 0 0 0] 1;
lambdaS         lambdaS [1 1 -3 -1 0 0 0] 1;
nuS             nuS [0 2 -1 0 0 0 0] 1e-06;

Ts              Ts [0 0 0 1 0 0 0] 1878;
Tl              Tl [0 0 0 1 0 0 0] 1928;
Tmelt           Tmelt [0 0 0 1 0 0 0] 1928;
hs              hs [0 2 -2 0 0 0 0] 282000;
beta            beta [0 0 0 -1 0 0 0] 1.1e-5;
DCl             DCl [0 0 -1 0 0 0 0] 1.6e06;
DCs             DCs [0 0 0 0 0 0 0] 1e-03;
sig3            sig3 [0 0 0 -1 0 0 0] 1;

// ************************************************************************* //
