additiveTestCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

convertToMeters 1e-3;

vertices
(
    (0 0 0)
    (15 0 0)
    (15 5 0)
    (0 5 0)
    (0 0 2)
    (15 0 2)
    (15 5 2)
    (0 5 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (375 125 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (    
	    (1 5 4 0)
	    (3 7 6 2)
	    (0 4 7 3)
	    (2 6 5 1)
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //
